Autodesk.Revit.DB.Analysis.MassSurfaceData.MaterialId
The visualization material used for the surface for displaying the energy analytical model.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input element materialId is not a material element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceData.ConceptualConstructionId
The id of the conceptual construction associated with the reference surface.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input element conceptualConstructionId is not a valid ConceptualConstructionType element id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012